{
  "_description": "Resolutions for ICE (Internal Consistency Evaluators) and WiX validation rules",
  "resolutions": [
    {"code": "ICE01", "resolution": "No action needed - this is a test ICE to verify validation is working."},
    {"code": "ICE02", "resolution": "Remove circular file references. Check the File table for self-referencing entries."},
    {"code": "ICE03", "resolution": "Fix data type mismatches. Ensure integers are in valid ranges and identifiers follow naming rules (max 72 chars, alphanumeric + underscore)."},
    {"code": "ICE04", "resolution": "Correct sequence numbers. Standard actions use ranges 1-1499 (Before), 1500-2500 (During), 2501+ (After). Custom actions must fit appropriately."},
    {"code": "ICE05", "resolution": "Fix Class table entries. Ensure unique CLSIDs per component and valid Context column values (LocalServer, LocalServer32, InprocServer, InprocServer32)."},
    {"code": "ICE06", "resolution": "Correct column definitions to match _Validation table. Check data types, nullable settings, and value constraints."},
    {"code": "ICE07", "resolution": "Install fonts to FontsFolder only. Move font files to a component targeting [FontsFolder]."},
    {"code": "ICE08", "resolution": "Set valid KeyPath. Reference a File or Registry entry within the component. At least one resource must be the KeyPath."},
    {"code": "ICE09", "resolution": "Don't use system directories as custom directories. Use StandardDirectory references instead of redefining SystemFolder, WindowsFolder, etc."},
    {"code": "ICE10", "resolution": "Remove UI actions from AdvtExecuteSequence. Advertisement runs silently; use InstallExecuteSequence for UI."},
    {"code": "ICE11", "resolution": "Resize dialog controls to fit within dialog boundaries. Check X, Y, Width, Height attributes."},
    {"code": "ICE12", "resolution": "Use valid custom action type. Type must be 1-54 for standard types. Check combination of source/target flags."},
    {"code": "ICE13", "resolution": "Add required attributes to controls. CheckBox needs Property, RadioButtonGroup needs Property, etc."},
    {"code": "ICE14", "resolution": "Fix feature parent references. Parent feature must exist and cannot create circular references."},
    {"code": "ICE15", "resolution": "Add Extension entry for each MIME type. Every MIME entry needs a corresponding Extension table entry."},
    {"code": "ICE16", "resolution": "Set ProductCode to valid GUID format: {8-4-4-4-12} with uppercase hex digits and braces."},
    {"code": "ICE17", "resolution": "Fix PushButton control events. ControlEvent entries must reference valid events (NewDialog, DoAction, SetProperty, etc.)."},
    {"code": "ICE18", "resolution": "Add CreateFolder entry when KeyPath is a directory. Components with directory KeyPath need CreateFolder for the same directory."},
    {"code": "ICE19", "resolution": "Fix AdvtExecuteSequence references. Actions in advertise sequence must be valid advertise-capable actions."},
    {"code": "ICE20", "resolution": "Add required dialog controls: Next, Back, Cancel buttons and required text elements as specified in _Validation."},
    {"code": "ICE21", "resolution": "Assign unique ComponentId GUID to each component. Never reuse GUIDs across components."},
    {"code": "ICE22", "resolution": "Fix FeatureComponents references. Both Feature and Component entries must exist in their respective tables."},
    {"code": "ICE23", "resolution": "Fix dialog tab order. TabIndex values should be sequential starting from 0 with no gaps."},
    {"code": "ICE24", "resolution": "Rename property to avoid reserved names. Don't use INSTALLLOCATION, etc. without understanding implications."},
    {"code": "ICE25", "resolution": "Merge module validation. Dependencies and exclusions must reference valid merge modules."},
    {"code": "ICE26", "resolution": "Fix required action conditions. Certain standard actions require specific conditions."},
    {"code": "ICE27", "resolution": "Fix Component conditions. Avoid component conditions that could orphan files."},
    {"code": "ICE28", "resolution": "ForceReboot action must be properly sequenced. Place after InstallFinalize in execute sequence."},
    {"code": "ICE29", "resolution": "Fix stream name conflicts. Binary and Icon names must not conflict with internal stream names."},
    {"code": "ICE30", "resolution": "Correct file sequence numbers. Files in same cabinet must have contiguous sequence numbers."},
    {"code": "ICE31", "resolution": "Fix control text length. Text must not exceed maximum allowed length."},
    {"code": "ICE32", "resolution": "Fix directory parent references. Directory parent must exist or be null for root."},
    {"code": "ICE33", "resolution": "Fix registry key path format. Use proper format: [1-6]\\path\\key for registry roots."},
    {"code": "ICE34", "resolution": "Fix RadioButton validation. All buttons in group must have same Property."},
    {"code": "ICE35", "resolution": "Fix cabinet name format. Cabinet names must follow 8.3 or specific naming rules."},
    {"code": "ICE36", "resolution": "Fix icon reference. Icons must exist in Icon or Binary table."},
    {"code": "ICE38", "resolution": "Fix component GUID. Each non-empty component needs a valid GUID (or use Guid='*' for auto-generation)."},
    {"code": "ICE39", "resolution": "Fix Summary Information. Required summary stream properties must be present and valid."},
    {"code": "ICE40", "resolution": "Fix miscellaneous validation errors as indicated in the specific message."},
    {"code": "ICE41", "resolution": "Fix extension references. Extension table entries must match ProgId references."},
    {"code": "ICE42", "resolution": "Fix shortcut icon. Shortcut Icon must reference valid Icon table entry."},
    {"code": "ICE43", "resolution": "Fix component self-referencing. Component references must not create cycles."},
    {"code": "ICE44", "resolution": "Fix dialog bitmap. DialogBitmap control must reference valid Binary table entry."},
    {"code": "ICE45", "resolution": "Fix LockPermissions table. Entries must reference valid domains and use proper SID format."},
    {"code": "ICE46", "resolution": "Fix custom action target. Property or key path must exist and be properly formatted."},
    {"code": "ICE47", "resolution": "Fix feature parent. Each feature can have only one parent (or none for root features)."},
    {"code": "ICE48", "resolution": "Fix directory with file reference. Files must reference existing directories."},
    {"code": "ICE49", "resolution": "Fix RegLocator table. Entries must have valid root, key, and name fields."},
    {"code": "ICE50", "resolution": "Fix shortcut/icon references. Icon must exist in Icon table and match ARPPRODUCTICON."},
    {"code": "ICE51", "resolution": "Fix font entry. Font table TrueType column must be null or valid font name."},
    {"code": "ICE52", "resolution": "Private properties in AppSearch. Public property names must be uppercase."},
    {"code": "ICE53", "resolution": "Fix registry value format. Registry values must use proper null-delimited format."},
    {"code": "ICE54", "resolution": "Fix companions file sequence. Companion file sequence must match parent file."},
    {"code": "ICE55", "resolution": "Fix LockPermissions object. Object must be file, registry key, or create folder entry."},
    {"code": "ICE56", "resolution": "Fix directory depth. Directory structure cannot exceed 32 levels."},
    {"code": "ICE57", "resolution": "Fix component per-user/per-machine. Component cannot mix per-user and per-machine resources."},
    {"code": "ICE58", "resolution": "Fix media layout. Media table must include all required cabinets."},
    {"code": "ICE59", "resolution": "Fix advertised shortcut. Advertised shortcuts need valid Feature reference."},
    {"code": "ICE60", "resolution": "Fix file version. File version must be in proper format."},
    {"code": "ICE61", "resolution": "Fix upgrade table. UpgradeCode references must be valid GUIDs."},
    {"code": "ICE62", "resolution": "Fix isolated components. Application and component must be in same feature."},
    {"code": "ICE63", "resolution": "Fix RemoveFile. RemoveFile entries need valid directory and file references."},
    {"code": "ICE64", "resolution": "Fix directory property. Directory property must exist in Directory table."},
    {"code": "ICE65", "resolution": "Fix environment variable. Environment table entries must have valid format."},
    {"code": "ICE66", "resolution": "Fix SQL custom action. ODBCDataSource validation."},
    {"code": "ICE67", "resolution": "Fix target path. TargetPath for non-advertised shortcuts must resolve to valid path."},
    {"code": "ICE68", "resolution": "Fix global assembly. Assemblies with processor architecture must be in matching directories."},
    {"code": "ICE69", "resolution": "Fix reserved bits. Attribute columns must not use reserved bit values."},
    {"code": "ICE70", "resolution": "Fix integer column. Integer value exceeds maximum allowed."},
    {"code": "ICE71", "resolution": "Fix MIME content type. ContentType must follow MIME format."},
    {"code": "ICE72", "resolution": "Fix custom action flag. Invalid custom action flag combination."},
    {"code": "ICE73", "resolution": "Fix package code. PackageCode must be a valid GUID."},
    {"code": "ICE74", "resolution": "Fix FASTOEM property. Only for OEM installations."},
    {"code": "ICE75", "resolution": "Fix custom action DLL. DLL custom actions must specify valid entry point."},
    {"code": "ICE76", "resolution": "Fix reserved words. Don't use reserved words as identifiers."},
    {"code": "ICE77", "resolution": "Fix per-user installs. OLE registration requires per-machine install."},
    {"code": "ICE78", "resolution": "Fix AdvtUISequence. Advertise UI sequence should be empty for silent operation."},
    {"code": "ICE79", "resolution": "Fix duplicate component references. Same component should not be in same feature twice."},
    {"code": "ICE80", "resolution": "Fix admin/install sequence action. Action must be in proper sequence for install type."},
    {"code": "ICE81", "resolution": "Fix minor upgrade validation. Minor upgrades have specific constraints."},
    {"code": "ICE82", "resolution": "Fix install level. InstallLevel must be positive integer."},
    {"code": "ICE83", "resolution": "Fix MsiAssembly table. Assembly file must exist and have valid attributes."},
    {"code": "ICE84", "resolution": "Fix sequence action reference. Referenced action must exist in sequence table."},
    {"code": "ICE85", "resolution": "Fix nested installation. Nested installs need special configuration."},
    {"code": "ICE86", "resolution": "Fix registry ACL. ModuleSignature validation for merge modules."},
    {"code": "ICE87", "resolution": "Fix COM registration. Class, TypeLib entries need valid component references."},
    {"code": "ICE88", "resolution": "Fix directory table. Directory table must have exactly one root entry."},
    {"code": "ICE89", "resolution": "Fix validation for ProgId advertisement. Check Class and Extension tables."},
    {"code": "ICE90", "resolution": "Fix shortcut directory. Shortcuts must target existing directories."},
    {"code": "ICE91", "resolution": "Fix file hash. FileHash must match file content for unversioned files."},
    {"code": "ICE92", "resolution": "Fix component on fixed/removable drive. Check component destination logic."},
    {"code": "ICE93", "resolution": "Fix custom action security. Type 2 (DLL) custom actions should avoid elevated execution when not needed."},
    {"code": "ICE94", "resolution": "Fix global assembly cache install. GAC components need proper configuration."},
    {"code": "ICE95", "resolution": "Fix control overlap. Dialog controls must not overlap."},
    {"code": "ICE96", "resolution": "Fix PublishComponent. Published component requires valid qualifier."},
    {"code": "ICE97", "resolution": "Fix component location. Two components should not install same file to same location."},
    {"code": "ICE98", "resolution": "Fix hyphenated identifier. Avoid hyphens in identifiers where not allowed."},
    {"code": "ICE99", "resolution": "Fix directory name. Directory name must not contain invalid characters."},
    {"code": "ICE100", "resolution": "Fix CreateFolder. CreateFolder must reference valid directory in component."},
    {"code": "ICE101", "resolution": "Fix isolated component DLL. IsolatedComponent shared DLL validation."},
    {"code": "ICE102", "resolution": "Fix assembly identity. Use consistent strong name for assemblies."},
    {"code": "ICE103", "resolution": "Fix nested install validation. Review nested install requirements."},
    {"code": "ICE104", "resolution": "Review system folder components. Installing to system folders requires careful consideration."},
    {"code": "ICE105", "resolution": "Fix SelfReg module. Ensure proper sequencing before SelfRegModules."},

    {"code": "BAL0001", "resolution": "Review bootstrapper application configuration. Ensure BootstrapperApplication element is properly configured."},
    {"code": "BAL0002", "resolution": "Fix BA theme path. Ensure theme XML file exists and is valid."},
    {"code": "BAL0003", "resolution": "Add localization files for BA. Create wxl files for all supported cultures."},
    {"code": "BAL0004", "resolution": "Add missing BA resource file. Check resource paths and ensure files exist."},
    {"code": "BAL0005", "resolution": "Configure license file properly. Use LicenseUrl or LicenseFile on WixStandardBootstrapperApplication."},
    {"code": "BAL0006", "resolution": "Fix BA configuration attributes. Review all BA element attributes for validity."},
    {"code": "BAL0007", "resolution": "Fix prerequisite package. Ensure prerequisite packages are properly authored."},
    {"code": "BAL0008", "resolution": "Ensure BA DLL exists. Check SourceFile path for BootstrapperApplication."},
    {"code": "BAL0009", "resolution": "Review overridable variable usage. Variable overrides must match declared variables."},
    {"code": "BAL0010", "resolution": "Fix BA condition. Review condition syntax and referenced variables."},

    {"code": "BURN0001", "resolution": "Fix bundle configuration. Check Bundle element and all required attributes."},
    {"code": "BURN0002", "resolution": "Review package warnings. Check all package references are valid."},
    {"code": "BURN0003", "resolution": "Fix chain configuration. Ensure Chain element contains valid packages."},
    {"code": "BURN0004", "resolution": "Review variable warnings. Check variable names and values."},
    {"code": "BURN0005", "resolution": "Fix payload configuration. Ensure all payloads are properly referenced."},
    {"code": "BURN1001", "resolution": "Fix bundle validation error. Review Bundle authoring for errors."},
    {"code": "BURN1002", "resolution": "Fix package configuration. Ensure package attributes are valid."},
    {"code": "BURN1003", "resolution": "Fix chain error. Review Chain structure and package ordering."},
    {"code": "BURN1004", "resolution": "Fix variable configuration. Review variable declarations and usage."},
    {"code": "BURN1005", "resolution": "Fix payload error. Check payload SourceFile and other attributes."},

    {"code": "LGHT0001", "resolution": "Fix candle/light error. Review the specific error message for details."},
    {"code": "LGHT0094", "resolution": "Unresolved reference. Add the missing fragment or include the referenced file."},
    {"code": "LGHT0204", "resolution": "ICE validation failed. Address the specific ICE error mentioned."},
    {"code": "LGHT1001", "resolution": "Linker error. Check file references and library paths."},
    {"code": "LGHT1002", "resolution": "Linker warning. Review warning and address if needed."},
    {"code": "LGHT1076", "resolution": "ICE reference error. The ICE validator found an issue - review the ICE code."},
    {"code": "LGHT1079", "resolution": "Expected condition error. Add required condition to element."},

    {"code": "CNDL0001", "resolution": "Fix WiX authoring error. Review XML for correct syntax."},
    {"code": "CNDL0002", "resolution": "Schema validation error. Ensure XML matches WiX schema."},
    {"code": "CNDL0150", "resolution": "Undefined preprocessor variable. Define the variable or remove the reference."},
    {"code": "CNDL1001", "resolution": "Candle error. Check source file syntax and paths."},
    {"code": "CNDL1016", "resolution": "Element not supported. The element may be deprecated or require an extension."},
    {"code": "CNDL1100", "resolution": "Found orphaned element. Ensure element is properly nested."},

    {"code": "WIX0001", "resolution": "General WiX error. Review error message for specific guidance."},
    {"code": "WIX0002", "resolution": "WiX warning. Consider addressing the warning to improve package quality."},
    {"code": "WIX1001", "resolution": "WiX extension error. Ensure extension is installed and configured correctly."},
    {"code": "WIX1002", "resolution": "WiX configuration error. Check project configuration files."},

    {"code": "UTIL0001", "resolution": "Util extension error. Review Util element configuration."},
    {"code": "SQL0001", "resolution": "SQL extension error. Review SqlDatabase and SqlScript configuration."},
    {"code": "IIS0001", "resolution": "IIS extension error. Review WebSite, WebApplication configuration."},
    {"code": "NETFX0001", "resolution": "NetFx extension error. Review .NET framework prerequisite configuration."},
    {"code": "FIRE0001", "resolution": "Firewall extension error. Review FirewallException configuration."},
    {"code": "HTTP0001", "resolution": "HTTP extension error. Review URL reservation configuration."},
    {"code": "EXT0001", "resolution": "Extension error. Review extension-specific configuration."},

    {"code": "VAL0001", "resolution": "Validation error. Review the specific validation message."},
    {"code": "VAL0002", "resolution": "Validation warning. Consider addressing to improve package quality."},

    {"code": "SMOK0001", "resolution": "Smoke test error. The installer failed basic validation tests."},
    {"code": "SMOK1001", "resolution": "Smoke test failure. Review smoke test results for specifics."},

    {"code": "ICEM01", "resolution": "Merge module ICE error. Review merge module authoring."},
    {"code": "ICEM02", "resolution": "Merge module validation. Check module dependencies and exports."},
    {"code": "ICEM03", "resolution": "Merge module component error. Fix component identifiers in module."},
    {"code": "ICEM04", "resolution": "Merge module directory error. Directory references must be valid."},
    {"code": "ICEM05", "resolution": "Module substitution error. Check ModuleSubstitution table."},
    {"code": "ICEM06", "resolution": "Module configuration error. Review ModuleConfiguration table."},
    {"code": "ICEM07", "resolution": "Module signature error. Ensure ModuleSignature is valid."},
    {"code": "ICEM08", "resolution": "Module exclusion error. Fix ModuleExclusion table entries."},
    {"code": "ICEM09", "resolution": "Module dependency error. Ensure referenced modules are available."}
  ]
}
