{
  "_description": "MSI database table descriptions for patching incomplete data",
  "tables": [
    {"name": "ActionText", "description": "Contains text displayed in the progress dialog during installation. Maps actions to descriptive strings shown to users."},
    {"name": "AdminExecuteSequence", "description": "Sequence table for administrative installation. Contains actions executed during 'msiexec /a' administrative installs."},
    {"name": "AdminUISequence", "description": "Sequence table for administrative UI. Contains UI actions during administrative installation."},
    {"name": "AdvtExecuteSequence", "description": "Sequence table for advertised installation. Contains actions for feature advertisement without full install."},
    {"name": "AdvtUISequence", "description": "Sequence table for advertised UI. Contains UI-related actions during advertisement."},
    {"name": "AppId", "description": "Contains information for DCOM application registration including RemoteServerName and activation settings."},
    {"name": "AppSearch", "description": "Maps properties to signatures for searching installed applications, files, or registry entries."},
    {"name": "BBControl", "description": "Billboard control table. Defines controls displayed on billboard dialogs during file copying."},
    {"name": "Billboard", "description": "Contains billboard information displayed during lengthy operations like file copying."},
    {"name": "Binary", "description": "Stores binary data like icons, bitmaps, and custom action DLLs embedded in the MSI package."},
    {"name": "BindImage", "description": "Contains information for binding executable files to DLLs during installation."},
    {"name": "CCPSearch", "description": "Compliance Checking Program search. Contains signatures for CCP product validation."},
    {"name": "CheckBox", "description": "Defines checkbox control values. Maps checkbox controls to property values."},
    {"name": "Class", "description": "COM class registration table. Contains CLSID, ProgID, and InprocServer information for COM components."},
    {"name": "ComboBox", "description": "Defines values for combo box controls. Contains property, order, value, and text for each item."},
    {"name": "CompLocator", "description": "Component locator table. Searches for components by ComponentId to find installed paths."},
    {"name": "Complus", "description": "COM+ application registration table. Contains information for COM+ component services."},
    {"name": "Component", "description": "Core table defining installation components. Each component has unique GUID, directory, and key path."},
    {"name": "Condition", "description": "Feature-level conditions table. Contains conditions that affect feature installation states."},
    {"name": "Control", "description": "Dialog control definitions. Contains all controls (buttons, text, checkboxes) for each dialog."},
    {"name": "ControlCondition", "description": "Dynamic control state conditions. Enables/disables/shows/hides controls based on property values."},
    {"name": "ControlEvent", "description": "Control event subscriptions. Maps control actions to events like NewDialog, SetProperty, DoAction."},
    {"name": "CreateFolder", "description": "Empty folder creation table. Lists directories to create even without files installed."},
    {"name": "CustomAction", "description": "Custom action definitions. Contains type, source, target for DLL, EXE, script, and property actions."},
    {"name": "Dialog", "description": "Dialog definitions table. Contains dialog dimensions, title, and attributes for all installer dialogs."},
    {"name": "Directory", "description": "Directory structure table. Defines folder hierarchy with parent references and default paths."},
    {"name": "DrLocator", "description": "Directory locator for searches. Used by AppSearch to locate directories on the system."},
    {"name": "DuplicateFile", "description": "File duplication table. Creates copies of installed files to additional locations."},
    {"name": "Environment", "description": "Environment variable table. Defines environment variables to set, append, or remove."},
    {"name": "Error", "description": "Error message table. Contains localized error messages for MSI error codes."},
    {"name": "EventMapping", "description": "Maps control events to control attributes. Used for progress bar and status text updates."},
    {"name": "Extension", "description": "File extension registration. Associates file extensions with ProgIds for shell integration."},
    {"name": "Feature", "description": "Feature hierarchy table. Defines installable features with parent relationships and install levels."},
    {"name": "FeatureComponents", "description": "Feature-component mapping. Links components to features they belong to."},
    {"name": "File", "description": "File table. Contains all files to install with version, size, and component references."},
    {"name": "FileSFPCatalog", "description": "System File Protection catalog mapping. Links files to SFP catalog files."},
    {"name": "Font", "description": "Font registration table. Contains font files to register with Windows font system."},
    {"name": "Icon", "description": "Icon storage table. Contains icon files used for shortcuts and ARP entries."},
    {"name": "IniFile", "description": "INI file modification table. Defines INI file entries to create or modify."},
    {"name": "IniLocator", "description": "INI file locator for searches. Reads INI values during AppSearch."},
    {"name": "InstallExecuteSequence", "description": "Main execution sequence. Contains all actions for installation including file copying and registration."},
    {"name": "InstallUISequence", "description": "UI sequence table. Contains dialog display and UI-related actions during installation."},
    {"name": "IsolatedComponent", "description": "Side-by-side component isolation. Redirects shared component to application-private location."},
    {"name": "LaunchCondition", "description": "Installation prerequisites. Contains conditions that must be true for installation to proceed."},
    {"name": "ListBox", "description": "List box control values. Defines items displayed in list box controls."},
    {"name": "ListView", "description": "List view control values. Defines items with icons for list view controls."},
    {"name": "LockPermissions", "description": "Security permissions table. Sets ACLs on files, registry keys, and folders."},
    {"name": "Media", "description": "Source media table. Defines cabinet files, disk prompts, and volume labels for source files."},
    {"name": "MIME", "description": "MIME type registration. Associates MIME content types with file extensions."},
    {"name": "MoveFile", "description": "File move/copy operations. Moves or copies existing files during installation."},
    {"name": "MsiAssembly", "description": ".NET and Win32 assembly registration. Registers assemblies with the Global Assembly Cache."},
    {"name": "MsiAssemblyName", "description": "Assembly name attributes. Contains assembly identity information (name, version, culture, token)."},
    {"name": "MsiDigitalCertificate", "description": "Digital certificate storage. Contains certificates for package signing verification."},
    {"name": "MsiDigitalSignature", "description": "Digital signature table. Links signed objects to their certificates."},
    {"name": "MsiDriverPackages", "description": "Driver package registration. Contains driver packages for DIFx installation."},
    {"name": "MsiEmbeddedChainer", "description": "Embedded chainer for multiple package installation. Chains MSI packages together."},
    {"name": "MsiEmbeddedUI", "description": "Embedded UI handler. Contains custom UI DLLs for enhanced installation experience."},
    {"name": "MsiFileHash", "description": "File hash values. Contains MD5 hashes for unversioned file change detection."},
    {"name": "MsiLockPermissionsEx", "description": "Extended permissions table. Sets security descriptors using SDDL strings."},
    {"name": "MsiPackageCertificate", "description": "Package certificate association. Links external packages to verification certificates."},
    {"name": "MsiPatchCertificate", "description": "Patch certificate table. Contains certificates for patch verification."},
    {"name": "MsiPatchHeaders", "description": "Patch header storage. Contains patch header blobs for delta patching."},
    {"name": "MsiPatchMetadata", "description": "Patch metadata table. Contains patch description, classification, and targets."},
    {"name": "MsiPatchOldAssemblyFile", "description": "Old assembly file references for patching. Maps old assembly files to patches."},
    {"name": "MsiPatchOldAssemblyName", "description": "Old assembly names for patching. Contains previous assembly identities."},
    {"name": "MsiPatchSequence", "description": "Patch sequencing information. Determines patch application order."},
    {"name": "MsiServiceConfig", "description": "Service configuration table. Contains delayed auto-start and failure action settings."},
    {"name": "MsiServiceConfigFailureActions", "description": "Service failure recovery. Defines actions on service failure (restart, reboot, run command)."},
    {"name": "MsiShortcutProperty", "description": "Extended shortcut properties. Contains app user model ID and other modern shortcut attributes."},
    {"name": "MsiSFCBypass", "description": "System File Checker bypass. Lists protected files that can be replaced during install."},
    {"name": "ODBCAttribute", "description": "ODBC driver/DSN attributes. Contains name-value pairs for ODBC configuration."},
    {"name": "ODBCDataSource", "description": "ODBC data source registration. Defines DSNs to create with driver and attributes."},
    {"name": "ODBCDriver", "description": "ODBC driver registration. Registers ODBC drivers with the system."},
    {"name": "ODBCSourceAttribute", "description": "ODBC source attributes. Additional attributes for data source configuration."},
    {"name": "ODBCTranslator", "description": "ODBC translator registration. Registers ODBC translators for code page conversion."},
    {"name": "Patch", "description": "Patch file mapping. Maps files to their patch transformations."},
    {"name": "PatchPackage", "description": "Embedded patch packages. Contains sub-patches within a patch package."},
    {"name": "ProgId", "description": "Programmatic identifier registration. Associates ProgIds with CLSIDs and file extensions."},
    {"name": "Property", "description": "Property table. Contains installation properties including ProductCode, ProductName, Manufacturer."},
    {"name": "PublishComponent", "description": "Component publishing. Publishes components for use by other applications via qualified components."},
    {"name": "RadioButton", "description": "Radio button group values. Defines radio button items with positions and values."},
    {"name": "Registry", "description": "Registry operations table. Contains registry keys and values to create or modify."},
    {"name": "RegLocator", "description": "Registry locator for searches. Reads registry values during AppSearch."},
    {"name": "RemoveFile", "description": "File removal table. Removes files on install, uninstall, or both."},
    {"name": "RemoveIniFile", "description": "INI entry removal. Removes specific INI file entries during installation."},
    {"name": "RemoveRegistry", "description": "Registry removal table. Removes registry keys or values during installation."},
    {"name": "ReserveCost", "description": "Disk space reservation. Reserves additional disk space beyond file sizes."},
    {"name": "SelfReg", "description": "Self-registration table. Lists DLLs to self-register via DllRegisterServer."},
    {"name": "ServiceControl", "description": "Service start/stop/delete. Controls Windows services during install and uninstall."},
    {"name": "ServiceInstall", "description": "Service installation table. Creates Windows services with name, display name, and start type."},
    {"name": "SFPCatalog", "description": "System File Protection catalogs. Contains catalog files for Windows File Protection."},
    {"name": "Shortcut", "description": "Shortcut creation table. Defines Start Menu and desktop shortcuts with targets and icons."},
    {"name": "Signature", "description": "File signature definitions. Describes files for AppSearch using name, version, size."},
    {"name": "TextStyle", "description": "Text formatting styles. Defines fonts, sizes, and colors for dialog text."},
    {"name": "TypeLib", "description": "Type library registration. Registers COM type libraries (.tlb) with version and language."},
    {"name": "UIText", "description": "UI string table. Contains localized strings for dialog controls and messages."},
    {"name": "Upgrade", "description": "Upgrade detection table. Finds related products by UpgradeCode for major upgrade handling."},
    {"name": "Verb", "description": "Shell verb registration. Defines shell commands (Open, Edit, Print) for file extensions."},
    {"name": "_Columns", "description": "Schema metadata. Describes columns for all tables in the database."},
    {"name": "_Storages", "description": "Storage metadata. Lists embedded storages (substorage streams) in the MSI."},
    {"name": "_Streams", "description": "Stream metadata. Lists binary streams embedded in the MSI (cabs, icons, binaries)."},
    {"name": "_Tables", "description": "Table metadata. Lists all tables present in the MSI database."},
    {"name": "_TransformView", "description": "Transform operations view. Shows operations in an applied transform."},
    {"name": "_Validation", "description": "Column validation rules. Contains data type, nullable, and range constraints for all columns."}
  ],
  "data_types": [
    {"name": "Identifier", "description": "Primary key or foreign key. Max 72 chars, alphanumeric and underscore only, must start with letter or underscore."},
    {"name": "Integer", "description": "16-bit signed integer. Range -32768 to 32767. Use for counts, flags, sequences."},
    {"name": "DoubleInteger", "description": "32-bit signed integer. Range -2147483648 to 2147483647. Use for sizes, LCID."},
    {"name": "Text", "description": "Localizable string up to 255 characters. Used for display names, descriptions."},
    {"name": "UpperCase", "description": "Uppercase-only string. Used for property names that must be public."},
    {"name": "LowerCase", "description": "Lowercase-only string. Rare, used for specific identifiers."},
    {"name": "Formatted", "description": "String with property substitution. [PropertyName] replaced at runtime. Max 255 chars."},
    {"name": "Template", "description": "Format template string. Used for formatted output patterns."},
    {"name": "Condition", "description": "Boolean condition expression. Evaluated at install time to true/false."},
    {"name": "GUID", "description": "Globally unique identifier. 38 chars in format {8-4-4-4-12} with braces and hyphens."},
    {"name": "Version", "description": "Version string. Format major.minor.build.revision (e.g., 1.2.3.4)."},
    {"name": "Filename", "description": "Short or long filename. Can include path separator. Max 255 chars."},
    {"name": "WildCardFilename", "description": "Filename with wildcards. Supports * and ? for pattern matching."},
    {"name": "Path", "description": "Directory path. Can be formatted with properties. Ends with backslash."},
    {"name": "Paths", "description": "Semicolon-delimited list of paths. Used for search paths."},
    {"name": "AnyPath", "description": "File or directory path. More flexible than Path type."},
    {"name": "RegPath", "description": "Registry path. Format: root\\subkey\\subkey. Root is numeric (2=HKLM, etc)."},
    {"name": "Binary", "description": "Binary data stream. References Binary table or external file."},
    {"name": "Cabinet", "description": "Cabinet file reference. # prefix for embedded, path for external."},
    {"name": "Shortcut", "description": "Shortcut target reference. File or directory identifier."},
    {"name": "Property", "description": "Property name reference. Must exist in Property table or be set at runtime."},
    {"name": "Language", "description": "Language ID or comma-separated list. LCID values like 1033 for en-US."}
  ]
}
